In [1]:
import pandas as pd

In [5]:
people = pd.read_csv('people.csv')
places = pd.read_csv('places.csv')

In [17]:
print(f"people's shape:{people.shape}")
print(f"places'shape: {places.shape}")

people's shape:(10000, 4)
places'shape: (114, 3)

In [6]:
people.head()

  given_name family_name date_of_birth place_of_birth
0       John    Williams    1842-09-30       Dumfries
1      Grace     Jeffery    1899-06-14          Kelso
2       Sean      Molnar    1982-11-01        Dromore
3       Lily       Doyle    1883-04-02       Hamilton
4      Edith      Styles    1879-07-24     Ballymoney

In [26]:
people.duplicated().sum()

np.int64(0)

In [27]:
places.duplicated().sum()

np.int64(0)

In [7]:
places.head()

         city            county   country
0    Aberdeen     Aberdeenshire  Scotland
1     Airdrie       Lanarkshire  Scotland
2       Alloa  Clackmannanshire  Scotland
3       Annan     Dumfriesshire  Scotland
4  Anstruther              Fife  Scotland

In [8]:
places.isnull().sum()

city       0
county     0
country    0
dtype: int64

In [9]:
people.isnull().sum()

given_name        0
family_name       0
date_of_birth     0
place_of_birth    0
dtype: int64